require "Mapping"
require "util"

--参数说明
--   [1]    = "pagename",    --页面名字
--   [2]    = "check_par",   --检查函数的参数
--   [3]    = "action_par",  --动作函数的参数
--   [4]    = "ending"       --动作结束后运行的函数
--   [5]    = "ending_par"   --动作结束后运行的参数
--   ["c"]  = "check",       --检查函数
--   ["cp"] = "check_par"    --检查函数的参数
--   ["co"] = "chechout"     --检查是否存在的的参数,默认是检查到点后执行动作,这个参数改成true后,是检查不到点才执行动作
--   ["a"]  = "action",      --动作函数
--   ["ap"] = "action_par"   --动作函数的参数
--   ["e"]  = "ending"       --动作结束后函数
--   ["ep"] = "ending_par"   --动作结束后函数的参数

-- --------------------登录-----------------------
function 登录()
local pages={
  {"登录主界面",{0xffff7c,"57|40|0x060201,61|-67|0x8f0e02,61|146|0x5e4a49", 95, 516, 127, 811, 445},{638,550},"sleep",200},
  {"选择角色界面",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},nil,"finish"},
  {"已登录",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},nil,"finish"}
}
mapping(pages)
end

function 选择角色进入游戏(role)
local pages={
  {
    {"选择角色1",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,138},"sleep",200},
    {"进入游戏",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,644},"finish"},
    {"已登录",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},nil,"finish"}
  },
  {
    {"选择角色2",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,269},"sleep",200},
    {"进入游戏",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,644},"finish"},
    {"已登录",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},nil,"finish"}
    },{
    {"选择角色3",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,396},"sleep",200},
    {"进入游戏",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,644},"finish"},
    {"已登录",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},nil,"finish"}
  },
  {
    {"选择角色4",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,522},"sleep",200},
    {"进入游戏",{0x323221,"51|-3|0x000e06,-185|55|0x3e1d07,-268|80|0x2b0a02", 95, 878, 575, 1266, 702},{1103,644},"finish"},
    {"已登录",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},nil,"finish"}
  }
}
mapping(pages[role])
end

-- --------------------离线奖励领取-----------------------
function 领取离线奖励()
local pages = {
  {'离线奖励未领vip',{0x7e4513,"136|-248|0xffe1ac,221|-247|0x47e47a,218|-230|0x2ab05c,132|-240|0xa86819", 90, 723, 119, 1055, 436},{763,411}},
  {'离线奖励领取',{0x372f16,"129|-248|0xffe1ac,214|-247|0x47e47a,211|-230|0x2ab05c,125|-240|0xa86819", 90, 661, 116, 1048, 439},{1176,45},"finish"},
  {"已登录",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},nil,"finish"}
}
mapping(pages)
end


-- --------------------除魔任务-----------------------
function 除魔任务()
local pages ={
  {"降妖除魔刷新界面finish",{0xdad6cd,"-4|6|0xe7e1d7,13|3|0xab8637,40|9|0xac7a38", 95, 168, 451, 267, 495},{434,362},"finish"},
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},"sleep",200},
  {"降妖除魔结束",{0xe7d621,"-11|-11|0xf5ed83,1|-19|0xf7f5a0,5|-5|0xe9e12b", 95, 655, 90, 726, 160},nil,"finish"},
  {"降妖除魔结束2",{0xfafafa,"14|2|0x838b93,21|-1|0x8a5746,24|-17|0x71480e", 95, 660, 92, 722, 158},nil,"finish"},
  {"降妖除魔结束3",{0x0a6544,"2|-16|0x40bcab,-9|-11|0x45cdbc,2|-16|0x40bcab", 95, 666, 100, 713, 149},nil,"finish"}, 
  {"降妖除魔结束4城主",{0xfcd764,"5|-12|0xffd692,-18|-7|0xe0bf3b,-7|1|0xe25602", 95, 659, 91, 725, 164},nil,"finish"},	
  {"降妖伏魔",{0xbb9922,"-1|18|0xc3a221,16|9|0xffff87,-8|7|0x8b7a43", 95, 664, 98, 722, 158},{1061,122},除魔任务详情}
}
mapping(pages)
end

function 除魔任务详情()
local pages ={
	{"除魔12次已做完",{0xe6e3de,"1|-5|0xfff7f7,-19|-8|0xf7f7ee,-10|-6|0xad8621", 95, 184, 600, 240, 639},{214,619},"finish"},
  {"领取降妖除魔奖励",{0xa83024,"-47|-4|0xfefbfa,-101|1|0xfcfbfb,-83|-14|0xc54a29", 95, 114, 401, 316, 462},{233,430},"finish"},
  {"领取降妖除魔奖励2",{0xfffbff,"-35|-12|0xeee6e6,-1|-17|0xb54129,-48|-5|0xf7eeee", 95, 176, 405, 285, 456},{233,430},"finish"},
	{"降妖除魔刷新",{0xdad6cd,"-4|6|0xe7e1d7,13|3|0xab8637,40|9|0xac7a38", 95, 168, 451, 267, 495},{212,468},"sleep",200}
  --TODO 降妖进行中每隔5s点击一次
  
}
if openHreo then
  table.insert(pages, {"降妖除魔挑战",{0xdad6cd,"-4|6|0xe7e1d7,13|3|0xab8637,40|9|0xac7a38", 95, 168, 451, 267, 495},{215,620},"sleep",200})
else
  --战神只召唤一次
  table.insert(pages, {"降妖除魔挑战",{0xdad6cd,"-4|6|0xe7e1d7,13|3|0xab8637,40|9|0xac7a38", 95, 168, 451, 267, 495},{215,620},召唤战神})
  openHreo=true
end

if _isPhone then
  -- 如果是手机就按手机的流程走，直接点击完成就可以了
  table.insert(pages, {"降妖除魔完成",{0x42df00,"-4|13|0x31da00,22|3|0x29be00,-28|5|0xffca00", 95, 132, 157, 208, 378},a="searchTap"})
else 
  -- 如果是模拟器，可能会刷不出左边的任务栏
  table.insert(pages, {"降妖除魔完成2",{0xf1f0ef,"23|3|0xcdc9c9,44|16|0xe7e5e5,64|15|0xb9b4b4", 95, 224, 164, 405, 430},nil,模拟器完成除魔任务})
end
return mapping(pages)
end

function 模拟器完成除魔任务()
local pages ={
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},"sleep",200},
  {"降妖伏魔",{0xbb9922,"-1|18|0xc3a221,16|9|0xffff87,-8|7|0x8b7a43", 95, 664, 98, 722, 158},{1061,122},"finish"}
}
mapping(pages)
end

function 召唤战神()
local pages ={
  {'准备召唤战神加载',{0xf5e4b1,"-5|-1|0xf4a221,-20|-12|0x36261d,-2|16|0xd3a04b", 95, 912, 6, 980, 81},nil,"sleep",2000},
  {'准备召唤战神',{0xf5e4b1,"-5|-1|0xf4a221,-20|-12|0x36261d,-2|16|0xd3a04b", 95, 912, 6, 980, 81},{947,52},"sleep",1000},
  {"召唤战神",{0xc6962b,"-11|20|0xdad1c4,52|14|0xb1a38c,-2|30|0x965c1a", 95, 577, 578, 762, 631},{670,603}},
  {"召唤战神finish",{0xf9e823,"-3|2|0xfff527,10|-22|0xfe7409,-12|14|0xf3af27", 95, 377, 175, 462, 515},a="finish",e=召唤战神结束}    
}
mapping(pages)
end
function 召唤战神结束()
local pages = {
  {"召唤战神结束",{0xf4db41,"-62|-10|0xead85c,28|-9|0xe7b45f,-18|7|0xffff63", 95, 568, 53, 774, 102},{1146,89},"finish"}
}
mapping(pages)
end


-- --------------------副本任务-----------------------
function 副本任务()
local pages ={
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},领取BOSS牌},
  -- {"副本任务",{0x0994a3,"0|-23|0xffffff,16|-6|0x027a69,-16|-3|0x35968e", 95, 157, 96, 223, 150},{562,123},羽毛任务},
  {"副本结束1",{0xf5dd06,"4|0|0xf9eb1a,-9|13|0xfbea0e,-7|5|0xe7ad07", 95, 161, 93, 217, 158},nil,"finish"},
  {"副本结束2火堆喝酒",{0xffffff,"0|-8|0xc89f55,-13|9|0x050534,-7|16|0x96a7b0", 95, 156, 93, 221, 159},nil,"finish"},
  {"副本任务",{0x27cce1,"-15|0|0x38d7e4,1|9|0x0f9eaf,-4|-14|0xffffff", 95, 155, 88, 226, 159},{562,123},羽毛任务},
  {"副本结束领奖励",{0xdf1918,"4|8|0xe11616,10|10|0xdf1817,-4|-13|0xdd1a19", 95, 29, 223, 105, 307},{108,355},"sleep",500},
  {"副本结束领奖励退出",{0xdf1918,"4|8|0xe11616,10|10|0xdf1817,-4|-13|0xdd1a19", 95, 29, 223, 105, 307},{108,355},"finish"},
  
}
mapping(pages)
end

function 羽毛任务()
local pages ={
  {'副本界面_羽毛',{0xdcb138,"17|0|0xfff5b1,-7|15|0xfffeca,29|-8|0xd10505", 95, 689, 165, 772, 258},{293,255},"sleep",1500},
  {'进入羽毛任务2次',{0xffffcc,"3|20|0xf9f9c6,0|1|0xffffcc,-14|-9|0xeedd99", 95, 783, 388, 815, 416},{790,568},"sleep",60000},
  {'进入羽毛任务1次',{0xfafac7,"0|1|0xf1f1bd,1|13|0xffffcc,-17|3|0xeedd99", 95, 782, 390, 815, 416},{790,568},"sleep",60000},
  {'羽毛副本结束',{0xeb2603,"-6|3|0x9f220e,-28|-2|0xeedd99,-20|-2|0xeedd99", 95, 752, 387, 817, 416},a="finish",e=宝石任务},
  {"副本结束",{0xdf1918,"4|8|0xe11616,10|10|0xdf1817,-4|-13|0xdd1a19", 95, 29, 223, 105, 307},nil,"finish"}
}
mapping(pages)
end
function 宝石任务()
local pages ={
  {'副本界面_宝石',{0xdcb138,"17|0|0xfff5b1,-7|15|0xfffeca,29|-8|0xd10505", 95, 689, 165, 772, 258},{293,405},"sleep",1500},
  {'进入宝石任务2次',{0xffffcc,"3|20|0xf9f9c6,0|1|0xffffcc,-14|-9|0xeedd99", 95, 783, 388, 815, 416},{790,568},"sleep",60000},
  {'进入宝石任务1次',{0xfafac7,"0|1|0xf1f1bd,1|13|0xffffcc,-17|3|0xeedd99", 95, 782, 390, 815, 416},{790,568},"sleep",60000},
  {'宝石副本结束',{0xeb2603,"-6|3|0x9f220e,-28|-2|0xeedd99,-20|-2|0xeedd99", 95, 752, 387, 817, 416},a="finish",e=护盾任务},
  {"副本结束",{0xdf1918,"4|8|0xe11616,10|10|0xdf1817,-4|-13|0xdd1a19", 95, 29, 223, 105, 307},nil,"finish"}
}
mapping(pages)
end
function 护盾任务()
local pages ={
  {'副本界面_护盾',{0xdcb138,"17|0|0xfff5b1,-7|15|0xfffeca,29|-8|0xd10505", 95, 689, 165, 772, 258},{293,328},"sleep",1500},
  {'进入护盾任务2次',{0xffffcc,"3|20|0xf9f9c6,0|1|0xffffcc,-14|-9|0xeedd99", 95, 783, 388, 815, 416},{790,568},"sleep",60000},
  {'进入护盾任务1次',{0xfafac7,"0|1|0xf1f1bd,1|13|0xffffcc,-17|3|0xeedd99", 95, 782, 390, 815, 416},{790,568},"sleep",60000},
  {'护盾副本结束',{0xeb2603,"-6|3|0x9f220e,-28|-2|0xeedd99,-20|-2|0xeedd99", 95, 752, 387, 817, 416},nil,"finish"},
  {"副本结束",{0xdf1918,"4|8|0xe11616,10|10|0xdf1817,-4|-13|0xdd1a19", 95, 29, 223, 105, 307},nil,"finish"}
}
mapping(pages)
end


-- --------------------膜拜城主-----------------------
function 膜拜城主()
local pages ={
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},"sleep",500},
  {"膜拜城主的位置被魂珠替代",{0x0a6544,"2|-16|0x40bcab,-9|-11|0x45cdbc,2|-16|0x40bcab", 95, 666, 100, 713, 149},nil,"finish"}, 
  {"膜拜城主",{0xe1a82c,"5|4|0xdc0e06,-14|21|0xdf1000,19|-10|0xc27e28", 95, 658, 92, 726, 157},{1070,120},膜拜城主详情,"finish"}
  
}
mapping(pages)
end
function 膜拜城主详情()
local pages = {
  {"免费膜拜城主",{0xeeece7,"2|-1|0xf9f8f6,-16|2|0xad8329,0|5|0xf9f8f5", 95, 123, 554, 262, 594},{208,576},"finish"}
}
mapping(pages)
end

-- --------------------通天塔-----------------------
function 通天塔()
local pages ={
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},领取BOSS牌},
  {"通天塔",{0xfad359,"0|-1|0xfad359,-16|7|0xf3d64f,-16|-9|0xe2c038", 95, 155, 194, 226, 266},{556,229},通天塔详情,"finish"},
  {"通天塔结束1",{0xffffff,"-11|-14|0x9a691f,-15|6|0x080833,-8|-1|0xffffff", 95, 161, 195, 221, 259},nil,"finish"}
}
mapping(pages)
end
function 通天塔详情()
	local pages={
		{"进入通天塔",{0xdc0101,"17|-10|0xc50402,-8|25|0xc79d2a,6|44|0xfefefe", 95, 157, 556, 268, 638},{226,625},"sleep","100"},
		{"进入通天塔2",{0xc50402,"-21|47|0xfcfcfb,1|50|0xffffff,-17|9|0xd90201", 95, 172, 549, 257, 640},{226,625},"sleep","100"},
		{"通天塔开始界面",{0xffdd77,"1|0|0xffdd77,8|-3|0x150d05,31|-6|0xffdd77", 95, 46, 131, 155, 166},nil,左移一段距离},
		{"通天塔九层",{0xff3300,"20|-4|0xe22000,27|8|0xfd3100,11|13|0xf63100", 95, 17, 259, 62, 289},{130,379},"sleep",500},
		{"退出通天塔",{0xeedd88,"-9|8|0x7d5423,47|3|0xe5d481,46|16|0xd9c67c", 95, 442, 268, 551, 307},{507,289},"finish"}
	}
	mapping(pages)
end
function 左移一段距离()
	local pages={
	}
	if not 通天塔是否左移了一段距离 then
		-- 只点击一次
		table.insert(pages, {"通天塔开始界面左移一段距离",{0xffdd77,"1|0|0xffdd77,8|-3|0x150d05,31|-6|0xffdd77", 95, 46, 131, 155, 166},{369,369},"finish"})
		通天塔是否左移了一段距离 =true
	end
	table.insert(pages, {"通天塔开始界面",{0xffdd77,"1|0|0xffdd77,8|-3|0x150d05,31|-6|0xffdd77", 95, 46, 131, 155, 166},nil,"finish"})
	mapping(pages)
end



-- --------------------个人BOSS-----------------------
function 个人BOSS()
local pages ={
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},领取BOSS牌},
  {"个人BOSS任务",{0x80afe5,"-6|18|0xb79a7b,17|-9|0xcb833a,15|15|0xdedab3", 95, 157, 292, 226, 369},{568,331},个人BOSS详情},
  {"个人BOSS挑战退出",{0xfedc76,"0|11|0xffdd77,18|5|0x1d0d05,-37|5|0x1d0d05", 95, 63, 133, 135, 168},{126,358},"finish"},
  {"个人BOSS结束1",{0xe0d31e,"-7|-9|0xeada50,-14|-14|0xf9f9d0,6|6|0x834706", 95, 160, 301, 218, 361},nil,"finish"}
}
mapping(pages)
end

function 个人BOSS详情()
local pages ={
  {'个人BOSS挑战界面',{0x975522,"38|17|0xe9e6b3,12|41|0x6b3e18,7|65|0x894f1e", 95, 58, 291, 123, 372},{1034,640},"sleep",500},
  {"个人BOSS挑战ING",{0xfedc76,"0|11|0xffdd77,18|5|0x1d0d05,-37|5|0x1d0d05", 95, 63, 133, 135, 168},nil,"finish"}
}
mapping(pages)
end

-- --------------------喝酒-----------------------
function 喝酒()
local pages ={
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},{875,41},领取BOSS牌},
  {'喝酒',{0xffffff,"-7|-12|0x9b6a1f,-13|7|0x080833,-7|-1|0xf9f9f9", 95, 157, 196, 220, 262},{1138,45},喝酒详情,"finish"}
}
mapping(pages)
end
function 喝酒详情()
local pages={
  {'已打开底部菜单',{0xd3b02a,"3|3|0xd5a520,16|2|0xf7f780,19|16|0x9a6313", 95, 311, 617, 373, 687},a="finish",e=打开包裹},
  {'打开底部菜单',{0xbfbf8c,"2|1|0xc8c29a,3|1|0xc7c7a5,-1|0|0xbfbf8c", 95, 601, 600, 677, 649},{642,649},打开包裹,"finish"}
}
mapping(pages)
end
function 打开包裹()
local pages={
  {'打开包裹',{0xd3b02a,"3|3|0xd5a520,16|2|0xf7f780,19|16|0x9a6313", 95, 311, 617, 373, 687},{341,659},"sleep",1000},
  {'包裹中',{0xf7e781,"12|4|0x885216,7|-2|0xc3b238,7|12|0xaa7722", 95, 135, 574, 168, 611},nil,找到并喝酒,"finish"}
}
mapping(pages)
end
function 找到并喝酒()
local pages={
  {'包裹中',{0xf7e781,"12|4|0x885216,7|-2|0xc3b238,7|12|0xaa7722", 95, 135, 574, 168, 611},nil,滚动搜索酒},
  {'找到酒了',{0xe9e9d8,"-33|5|0x60601e,-18|-4|0x27270e,-13|29|0x000000", 95, 141, 78, 718, 541},nil,"sleep",1500,a="searchTap"},
  {'使用酒',{0xf8f7c4,"0|0|0xf8f7c4,0|-9|0xfcfac7,12|-12|0x96651a", 100, 133, 222, 1078, 563},nil,"sleep",1000,a="searchTap"},
  {'包裹中结束喝酒',{0xf7e781,"12|4|0x885216,7|-2|0xc3b238,7|12|0xaa7722", 95, 135, 574, 168, 611},{718,46},"finish"}
}
mapping(pages)
end
function 滚动搜索酒()
local pages={
  {'找到酒了',{0xe9e9d8,"-33|5|0x60601e,-18|-4|0x27270e,-13|29|0x000000", 95, 141, 78, 718, 541},nil,"finish"},
  {'向上滚动一段距离',{0xf7e781,"12|4|0x885216,7|-2|0xc3b238,7|12|0xaa7722", 95, 135, 574, 168, 611},{427,539,427,90},a="swip","sleep",2000},
  {'找到酒了',{0xe9e9d8,"-33|5|0x60601e,-18|-4|0x27270e,-13|29|0x000000", 95, 141, 78, 718, 541},nil,"finish"},
  {'向上滚动一段距离',{0xf7e781,"12|4|0x885216,7|-2|0xc3b238,7|12|0xaa7722", 95, 135, 574, 168, 611},{427,539,427,90},a="swip","sleep",2000},
  {'找到酒了',{0xe9e9d8,"-33|5|0x60601e,-18|-4|0x27270e,-13|29|0x000000", 95, 141, 78, 718, 541},nil,"finish"},
  {'向下滚动一段距离',{0xf7e781,"12|4|0x885216,7|-2|0xc3b238,7|12|0xaa7722", 95, 135, 574, 168, 611},{427,90,427,539},a="swip","finish"}
}
mapping(pages)
end




-- --------------------领取BOSS牌-----------------------
function 领取BOSS牌()
local pages ={
  {'领取BOSS牌5',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{975,549}},
  {'领取BOSS牌4',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{807,549}},
  {'领取BOSS牌4',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{807,549}},
  {'领取BOSS牌3',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{643,549}},
  {'领取BOSS牌2',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{476,549}},
  {'领取BOSS牌1',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{318,549}},
  {'领取BOSS牌去除提示',{0x4a9f4a,"0|-4|0x2ca32c,2|-12|0x41a441,-3|-2|0x1e6219", 95, 283, 513, 338, 575},{382,542},"finish"},
  {'每日必做',{0xe4b968,"-1|18|0x6d3a0c,12|12|0x9d5915,-5|-6|0xf9d793", 95, 842, 13, 910, 78},nil,"finish"}
}
mapping(pages)
end


-- --------------------返回登录界面-----------------------
function 返回登录界面()
local pages={
  {'已打开底部菜单',{0xd3b02a,"3|3|0xd5a520,16|2|0xf7f780,19|16|0x9a6313", 95, 311, 617, 373, 687},a="finish",e=打开设置},
  {'打开底部菜单',{0xbfbf8c,"2|1|0xc8c29a,3|1|0xc7c7a5,-1|0|0xbfbf8c", 95, 601, 600, 677, 649},{642,649},打开设置,"finish"}
}
mapping(pages)
end
function 打开设置()
local pages={
  {'打开设置',{0xd3b02a,"3|3|0xd5a520,16|2|0xf7f780,19|16|0x9a6313", 95, 311, 617, 373, 687},{1017,661},"sleep",1000},
  {'进入设置界面',{0xfafac8,"7|0|0xffffcc,-5|-40|0xf3f3c1,-5|-34|0xfbfbc7", 95, 78, 200, 123, 289},{103,360},"sleep",500},
  {'返回登录',{0xfbfac7,"12|-5|0xfffecb,60|-11|0xf8f7c3,43|-12|0x955b1a", 95, 406, 604, 549, 647},{478,624},"sleep",3000},
  {"已返回登录主界面",{0xffff7c,"57|40|0x060201,61|-67|0x8f0e02,61|146|0x5e4a49", 95, 516, 127, 811, 445},nil,"finish"}
}
mapping(pages)
end






-- --------------------降妖除魔仅升级-----------------------
function 除魔仅升级()
local pages={
  {"打开地图",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},{1189,41},"sleep",200},
  {'当前地图',{0x7e7d6b,"7|-12|0xcc9a40,46|-1|0x877573,32|12|0xcca350", 95, 19, 263, 136, 319},{80,205},"sleep",100},
	{'进入比奇城',{0x81806f,"-23|2|0x847c74,-12|-7|0xcca348,-1|15|0xcda34e", 95, 20, 172, 132, 227},{704,349},去除魔,"finish"}
}
mapping(pages)
end
function 去除魔()
local pages={
	{'世界地图进当前地图',{0x81806f,"-23|2|0x847c74,-12|-7|0xcca348,-1|15|0xcda34e", 95, 20, 172, 132, 227},{74,292},"sleep",200},
	{'在比奇打开地图',{0xddddaa,"36|-9|0xdadaa8,30|-16|0xdcdca9,16|-7|0x4c2302", 95, 1149, 10, 1227, 52},{1189,41},"sleep",500},
	{'当前地图走向除魔',{0x7e7d6b,"7|-12|0xcc9a40,46|-1|0x877573,32|12|0xcca350", 95, 19, 263, 136, 319},{472,196},寻找除魔,"finish"}
}
mapping(pages)
end
function 寻找除魔()
	local pages={
		{'关闭当前地图',{0x7e7d6b,"7|-12|0xcc9a40,46|-1|0x877573,32|12|0xcca350", 95, 19, 263, 136, 319},{1159,89},"sleep",500},
		{'找到除魔人',{0x5a1c21,"16|-6|0x293542,6|6|0x5a1c29,21|5|0x292419", 95, 484, 272, 627, 414},nil,除魔12次,"finish"}--直接用上面的除魔脚本
	}
	mapping(pages)
end
function 除魔12次()
local pages={
		{'找到除魔人',{0x5a2021,"16|-9|0x29354a,16|1|0x191408,3|2|0x4a1819", 95, 396, 189, 781, 496},nil,"sleep",500,a="searchTap"},
		{"除魔12次已做完",{0xe6e3de,"1|-5|0xfff7f7,-19|-8|0xf7f7ee,-10|-6|0xad8621", 95, 184, 600, 240, 639},{214,619},"finish"},
		{"降妖除魔刷新界面finish",{0xdad6cd,"-4|6|0xe7e1d7,13|3|0xab8637,40|9|0xac7a38", 95, 168, 451, 267, 495},nil,除魔任务详情,"finish"}
	}
	mapping(pages)
end

-- --------------------通天塔仅升级-----------------------
function 通天塔仅升级()
local pages={
  {"打开地图",{0xd5cc67,"30|0|0xb4ac83,56|15|0x7b6b53,-3|-3|0xd4cb60", 95, 13, 0, 102, 58},{1189,41},"sleep",200},
  {'当前地图',{0x7e7d6b,"7|-12|0xcc9a40,46|-1|0x877573,32|12|0xcca350", 95, 19, 263, 136, 319},{80,205},"sleep",100},
	{'进入比奇城',{0x81806f,"-23|2|0x847c74,-12|-7|0xcca348,-1|15|0xcda34e", 95, 20, 172, 132, 227},{704,349},去通天塔,"finish"}
}
mapping(pages)
end
function 去通天塔()
local pages={
	{'世界地图进当前地图',{0x81806f,"-23|2|0x847c74,-12|-7|0xcca348,-1|15|0xcda34e", 95, 20, 172, 132, 227},{74,292},"sleep",200},
	{'在比奇打开地图',{0xddddaa,"36|-9|0xdadaa8,30|-16|0xdcdca9,16|-7|0x4c2302", 95, 1149, 10, 1227, 52},{1189,41},"sleep",500},
	{'当前地图走向通天塔',{0x7e7d6b,"7|-12|0xcc9a40,46|-1|0x877573,32|12|0xcca350", 95, 19, 263, 136, 319},{737,387},寻找通天塔,"finish"}
}
mapping(pages)
end
function 寻找通天塔()
	local pages={
		{'关闭当前地图',{0x7e7d6b,"7|-12|0xcc9a40,46|-1|0x877573,32|12|0xcca350", 95, 19, 263, 136, 319},{1159,89},"sleep",1000},
		{'找到通天塔NPC',{0x290c08,"22|-31|0xad8142,-7|-1|0x210800,-1|-4|0x210408", 95, 605, 166, 1010, 541},nil,"sleep",200,a="searchTap"},--直接用上面的通天塔脚本
		{'挑战次数为0',{0xce0400,"-8|-1|0xe60400,-3|0|0x422019,-3|29|0xad8121", 95, 255, 549, 310, 634},{223,621},"finish"},
		{"进入通天塔1次",{0xde0000,"0|4|0xce0400,-2|3|0x3a1c10,-2|33|0xb58129", 95, 272, 555, 298, 619},nil,通天塔详情},
		{"进入通天塔2次",{0xcd0808,"2|3|0xef0000,-3|13|0xe60400,-1|34|0xad8621", 95, 274, 557, 301, 615},nil,通天塔详情}
	}
	mapping(pages)
end












